### Import Library and Load Data

In [86]:
import pandas as pd

In [87]:
df = pd.read_csv("https://raw.githubusercontent.com/jaabberwocky/dataeng_test/master/dataset.csv",error_bad_lines=False)

### Processing Data

In [88]:
df.dtypes

name      object
price    float64
dtype: object

In [89]:
#Split the name field into first_name, and last_name
df["first_name"] = df["name"].str.split(" ",n=1,expand=True)[0]
df["last_name"] = df["name"].str.split(" ",n=1,expand=True)[1]

In [90]:
#Remove any zeros prepended to the price field
df["new_price"] = [i.lstrip("0") for i in df.price.astype(str)]
df["new_price"] = df["new_price"].astype(float)

In [91]:
#Delete any rows which do not have a name
df[df.name.notnull()]

                 name       price first_name  last_name   new_price
0       William Dixon  109.037280    William      Dixon  109.037280
1        Kristen Horn  262.524652    Kristen       Horn  262.524652
2      Kimberly Chang  187.007258   Kimberly      Chang  187.007258
3           Mary Ball  283.174648       Mary       Ball  283.174648
4      Benjamin Craig  143.871582   Benjamin      Craig  143.871582
...               ...         ...        ...        ...         ...
9995     Rachel Davis   95.253955     Rachel      Davis   95.253955
9996  Connie Hamilton  205.396685     Connie   Hamilton  205.396685
9997      Sean Kaiser   80.547371       Sean     Kaiser   80.547371
9998  Ebony Rodriguez   93.205616      Ebony  Rodriguez   93.205616
9999  Gregg Alexander  297.046886      Gregg  Alexander  297.046886

[10000 rows x 5 columns]

In [92]:
#double check
df[(df.name.isnull()) | (df.name=="") | (df.name=="NA")]

Empty DataFrame
Columns: [name, price, first_name, last_name, new_price]
Index: []

In [93]:
#check duplicates
df.loc[df.duplicated(subset=['name'])]

                     name       price   first_name last_name   new_price
249       Heather Collins  147.427407      Heather   Collins  147.427407
270        Robert Johnson  174.692235       Robert   Johnson  174.692235
292        William Taylor  275.633176      William    Taylor  275.633176
466             Tony Hall  135.855096         Tony      Hall  135.855096
542          James Miller  202.229649        James    Miller  202.229649
...                   ...         ...          ...       ...         ...
9944       Barbara Garcia  284.382510      Barbara    Garcia  284.382510
9946      Michael Johnson   14.656500      Michael   Johnson   14.656500
9952        Michael Payne   75.365019      Michael     Payne   75.365019
9989  Christopher Johnson  236.006414  Christopher   Johnson  236.006414
9995         Rachel Davis   95.253955       Rachel     Davis   95.253955

[614 rows x 5 columns]

In [94]:
#Create a new field named above_100, which is true if the price is strictly greater than 100
df['above_100'] = df['new_price'].apply(lambda x: 'true' if x>100 else 'false')

In [95]:
new_df = df[["name","first_name","last_name","new_price","above_100"]]

In [99]:
new_df.to_csv("./ProcessedFile.csv")